updated readme and deployment guide
